Revit 2027 API
ApplicationException.FunctionId Property
The information of the function throwing the exception.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FunctionId FunctionId { get; }
Public ReadOnly Property FunctionId As FunctionId
	Get
public:
property FunctionId^ FunctionId {
	FunctionId^ get ();
}
member FunctionId : FunctionId with get
Property Value
FunctionId
See Also
Reference
ApplicationException Class
Autodesk.Revit.Exceptions Namespace